CommunityGD32Cores/platform-gd32/misc/svd/GD32A503.svd
	<register>
          <name>RWM2CS</name>
          <displayName>RWM2CS</displayName>
          <description>CAN_sleep mode received wakeup mailbox x control status information register</description>
          <addressOffset>0xB60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSRR</name>
              <description>Received SRR bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RIDE</name>
              <description>Received IDE bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRTR</name>
              <description>Received RTR bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDLC</name>
              <description>Received DLC bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RWM3CS</name>
          <displayName>RWM3CS</displayName>
          <description>CAN_sleep mode received wakeup mailbox x control status information register</description>
          <addressOffset>0xB70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSRR</name>
              <description>Received SRR bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RIDE</name>
              <description>Received IDE bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RRTR</name>
              <description>Received RTR bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDLC</name>
              <description>Received DLC bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_RWM0I</name>
          <displayName>SLP_RWM0I</displayName>
          <description>CAN_sleep mode received wakeup mailbox x identifier register</description>
          <addressOffset>0xB44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RID</name>
              <description>Received ID bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_RWM1I</name>
          <displayName>SLP_RWM1I</displayName>
          <description>CAN_sleep mode received wakeup mailbox x identifier register</description>
          <addressOffset>0xB54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RID</name>
              <description>Received ID bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_RWM2I</name>
          <displayName>SLP_RWM2I</displayName>
          <description>CAN_sleep mode received wakeup mailbox x identifier register</description>
          <addressOffset>0xB64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RID</name>
              <description>Received ID bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>SLP_RWM3I</name>
          <displayName>SLP_RWM3I</displayName>
          <description>CAN_sleep mode received wakeup mailbox x identifier register</description>
          <addressOffset>0xB74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RID</name>
              <description>Received ID bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RWM0D0</name>
          <displayName>RWM0D0</displayName>
          <description>CAN_sleep mode received wakeup mailbox x data 0 register</description>
          <addressOffset>0xB48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDB0</name>
              <description>Received data byte 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB1</name>
              <description>Received data byte 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB2</name>
              <description>Received data byte 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB3</name>
              <description>Received data byte 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RWM1D0</name>
          <displayName>RWM1D0</displayName>
          <description>CAN_sleep mode received wakeup mailbox x data 0 register</description>
          <addressOffset>0xB58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDB0</name>
              <description>Received data byte 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB1</name>
              <description>Received data byte 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB2</name>
              <description>Received data byte 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB3</name>
              <description>Received data byte 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RWM2D0</name>
          <displayName>RWM2D0</displayName>
          <description>CAN_sleep mode received wakeup mailbox x data 0 register</description>
          <addressOffset>0xB68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDB0</name>
              <description>Received data byte 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB1</name>
              <description>Received data byte 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB2</name>
              <description>Received data byte 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB3</name>
              <description>Received data byte 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
	<register>
          <name>RWM3D0</name>
          <displayName>RWM3D0</displayName>
          <description>CAN_sleep mode received wakeup mailbox x data 0 register</description>
          <addressOffset>0xB78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDB0</name>
              <description>Received data byte 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB1</name>
              <description>Received data byte 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB2</name>
              <description>Received data byte 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB3</name>
              <description>Received data byte 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RWM0D1</name>
          <displayName>RWM0D1</displayName>
          <description>CAN_sleep mode received wakeup mailbox x data 1 register</description>
          <addressOffset>0xB4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDB4</name>
              <description>Received data byte 4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB5</name>
              <description>Received data byte 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB6</name>
              <description>Received data byte 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB7</name>
              <description>Received data byte 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RWM1D1</name>
          <displayName>RWM1D1</displayName>
          <description>CAN_sleep mode received wakeup mailbox x data 1 register</description>
          <addressOffset>0xB5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDB4</name>
              <description>Received data byte 4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB5</name>
              <description>Received data byte 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB6</name>
              <description>Received data byte 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB7</name>
              <description>Received data byte 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RWM2D1</name>
          <displayName>RWM2D1</displayName>
          <description>CAN_sleep mode received wakeup mailbox x data 1 register</description>
          <addressOffset>0xB6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDB4</name>
              <description>Received data byte 4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB5</name>
              <description>Received data byte 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB6</name>
              <description>Received data byte 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB7</name>
              <description>Received data byte 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>RWM3D1</name>
          <displayName>RWM3D1</displayName>
          <description>CAN_sleep mode received wakeup mailbox x data 1 register</description>
          <addressOffset>0xB7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDB4</name>
              <description>Received data byte 4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB5</name>
              <description>Received data byte 5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB6</name>
              <description>Received data byte 6</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDB7</name>
              <description>Received data byte 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>FDCTL</name>
          <displayName>FDCTL</displayName>
          <description>FD control register</description>
          <addressOffset>0xC00</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000101</resetValue>
          <fields>
            <field>
              <name>BRSEN</name>
              <description>Bit rate of data switch enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MDSZ</name>
              <description>Mailbox data size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDCEN</name>
              <description>Transmitter delay compensation enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDCS</name>
              <description>Transmitter delay compensation status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDCO</name>
              <description>Transmitter delay compensation offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDCV</name>
              <description>Transmitter delay compensation value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>

	<register>
          <name>FDBT</name>
          <displayName>FDBT</displayName>
          <description>FD bit timing register</description>
          <addressOffset>0xC04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBAUDPSC</name>
              <description>Baud rate prescaler for data bit time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSJW</name>
              <description>Resynchronization jump width for data bit time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPTS</name>
              <description>Propagation time segment for data bit time</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPBS1</name>
              <description>Phase buffer segment 1 for data bit time</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPBS2</name>
              <description>Phase buffer segment 2 for data bit time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

	<register>
          <name>CRCCFD</name>
          <displayName>CRCCFD</displayName>
          <description>CRC for classical and FD frame register</description>
          <addressOffset>0xC08</addressOffset>
          <size>0x20</size>
          <resetValue> 0x00000000</resetValue>
          <fields>
            <field>
              <name>ANTM</name>
              <description>Associated number of mailbox for transmitting the CRCTCI[20:0] value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCTCI</name>
              <description>Transmitted CRC value for classical and ISO / non-ISO FD frames</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
