CommunityGD32Cores/platform-gd32/misc/svd/GD32A503.svd
      </registers>
    </peripheral>
   <peripheral>
      <name>DMAMUX</name>
      <description>DMAMUX controller</description>
      <groupName>DMAMUX</groupName>
      <baseAddress>0x40020800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA_MUX</name>
        <value>47</value>
      </interrupt>
      <registers>
        <register>
          <name>RM_CH0CFG</name>
          <displayName>RM_CH0CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH1CFG</name>
          <displayName>RM_CH1CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH2CFG</name>
          <displayName>RM_CH2CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH3CFG</name>
          <displayName>RM_CH3CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH4CFG</name>
          <displayName>RM_CH4CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH5CFG</name>
          <displayName>RM_CH5CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH6CFG</name>
          <displayName>RM_CH6CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH7CFG</name>
          <displayName>RM_CH7CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH8CFG</name>
          <displayName>RM_CH8CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH9CFG</name>
          <displayName>RM_CH9CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
        <register>
          <name>RM_CH10CFG</name>
          <displayName>RM_CH10CFG</displayName>
          <description>Request multiplexer channel x configuration register </description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYNCID</name>
              <description>Synchronization input identification</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NBR</name>
              <description>Number of DMA requests to forward</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SYNCP</name>
              <description>Synchronization input polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVGEN</name>
              <description>Event generation enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOIE</name>
              <description>Synchronization overrun interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXID</name>
              <description>Multiplexer input identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>        
          </fields>
        </register>
