CommunityGD32Cores/platform-gd32/misc/svd/GD32A503.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TRIGSEL</name>
      <description>Trigger selection controller</description>
      <groupName>TRIGSEL</groupName>
      <baseAddress>0x40018400</baseAddress>
         <addressBlock>
         <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
          </addressBlock>
          <registers>
             <register>
          <name>EXTOUT0</name>
          <displayName>EXTOUT0</displayName>
          <description>Trigger selection for EXTOUT0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
          <register>
          <name>EXTOUT1</name>
          <displayName>EXTOUT1</displayName>
          <description>Trigger selection for EXTOUT1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
           <register>
          <name>ADC0</name>
          <displayName>ADC0</displayName>
          <description>Trigger selection for ADC0 register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001E16</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

           <register>
          <name>ADC1</name>
          <displayName>ADC1</displayName>
          <description>Trigger selection for ADC1 register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001E16</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

           <register>
          <name>DAC</name>
          <displayName>DAC</displayName>
          <description>Trigger selection for DAC register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000015</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

          <register>
          <name>TIMER0IN</name>
          <displayName>TIMER0IN</displayName>
          <description>Trigger selection for TIMER0_ITI register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x27272727</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
         <register>
          <name>TIMER0BRKIN</name>
          <displayName>TIMER0BRKIN</displayName>
          <description>Trigger selection for TIMER0_BRKIN register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
         <register>
          <name>TIMER7IN</name>
          <displayName>TIMER7IN</displayName>
          <description>Trigger selection for TIMER7_ITI register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x30303030</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

         <register>
          <name>TIMER7BRKIN</name>
          <displayName>TIMER7BRKIN</displayName>
          <description>Trigger selection for TIMER7_BRKIN register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

         <register>
          <name>TIMER19IN</name>
          <displayName>TIMER19IN</displayName>
          <description>Trigger selection for TIMER19_ITI register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x39393939</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

         <register>
          <name>TIMER19BRKIN</name>
          <displayName>TIMER19BRKIN</displayName>
          <description>Trigger selection for TIMER19_BRKIN register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x39393939</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

         <register>
          <name>TIMER20IN</name>
          <displayName>TIMER20IN</displayName>
          <description>Trigger selection for TIMER20_ITI register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x15151515</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

         <register>
          <name>TIMER20BRKIN</name>
          <displayName>TIMER20BRKIN</displayName>
          <description>Trigger selection for TIMER20_BRKIN register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER1IN</name>
          <displayName>TIMER1IN</displayName>
          <description>Trigger selection for TIMER1_ITI register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x1E1E1E1E</resetValue>
          <fields>
            <field>
              <name>LK</name>
              <description>TRIGSEL register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INSEL3</name>
              <description>Trigger input source selection for output3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL2</name>
              <description>Trigger input source selection for output2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL1</name>
              <description>Trigger input source selection for output1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEL0</name>
              <description>Trigger input source selection for output0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
